// переменные для вывода текста

textSpeed = 0.2

x1 = RESOLUTION_W/2
y1 = RESOLUTION_H -180
x2 = RESOLUTION_W/2
y2 = RESOLUTION_H

x1Target = 0
x2Target = RESOLUTION_W

lerpProgress = 0
textProgress = 0

// текст истории
messege = "Наш герой был наёмным охотником за монстрами," +
		 "\n путешествующим по всей стране и ищущим тех, кто" +
		 "\n нуждался в его услугах. Однажды, во время одной" +
		 "\n из своих миссий, герой был пойман и заточён в плен."+
		 "\n Там он был предан пыткам, которые сдорово ослабили его."+
		 "\n Но даже обесиленый и полуживой он смог бежать"+
		 "\n и бежал, пока не прибыл в родную деревню."+
		 "\n Полудохлый, без оружия и гроша в кармане, он с горечью"+
		 "\n обнаружил, что его родная деревня, некогда мирное и"+
		 "\n прекрастное место, населена монстрами..."










//alarm[0] = 120